blog-posts/2003-10-06-interesting-uses-of-emacspeak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Interesting uses of Emacspeak</title>
<!-- 2015-10-19 Mon 14:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Interesting uses of Emacspeak</h1>
<p>
October 6th, 2003 -
<a href="http://sachachua.com/blog/p/1205"><a href="http://sachachua.com/blog/p/1205">http://sachachua.com/blog/p/1205</a></a>
</p>

<p>
CSJ wrote on the debian-user mailing list:
</p>

<pre class="example">
For helping teach my kid to read I used emacs running emacspeak.
The robotic language, via the eflite speech synthesis server, was
sufficient to get the words' pronunciation across.  Type
"D-O-G-" in a buffer and you get the audio feedback "dog."
I used to set the xterm to the most massive font size available
(by adjusting the font and screen sizes) to make reading, or so I
assumed, easier for preschool eyes.
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
